In [ ]:
%load_ext sql

In [ ]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

## Table Creation and Data Insertion

In [ ]:
%%sql
CREATE TABLE CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

In [ ]:
%%sql
INSERT INTO CustomerTransactions VALUES
(1, 'Mobile',  'Ravi',   '192.168.1.1',  'Laptop',     50000.00, TRUE,  FALSE, 'Completed'),
(2, 'Desktop', 'Priya',  '192.168.1.2',  'Smartphone', 20000.00, TRUE,  TRUE,  'Completed'),
(3, 'Tablet',  'Arjun',  '192.168.1.3',  'Headphones', 1500.00,  FALSE, TRUE,  'Failed'),
(4, 'Mobile',  'Meena',  '192.168.1.4',  'Shoes',      2500.00,  TRUE,  FALSE, 'Completed'),
(5, 'Desktop', 'Karthik','192.168.1.5',  'Watch',      5000.00,  TRUE,  TRUE,  'Completed'),
(6, 'Mobile',  'Sowmya', '192.168.1.6',  'Tablet',     15000.00, TRUE,  TRUE,  'Completed'),
(7, 'Tablet',  'Ramesh', '192.168.1.7',  'Smartphone', 25000.00, FALSE, TRUE,  'Failed'),
(8, 'Desktop', 'Divya',  '192.168.1.8',  'Laptop',     60000.00, TRUE,  FALSE, 'Completed'),
(9, 'Mobile',  'Arun',   '192.168.1.9',  'Smartwatch', 12000.00, TRUE,  TRUE,  'Completed'),
(10,'Tablet',  'Deepa',  '192.168.1.10', 'Laptop',     55000.00, FALSE, FALSE, 'Pending');

## Aggregate Functions

In [ ]:
%%sql
SELECT COUNT(*) FROM CustomerTransactions;

In [ ]:
%%sql
SELECT COUNT(*) FROM CustomerTransactions WHERE transaction_status = 'Completed';

In [ ]:
%%sql
SELECT SUM(amount) AS total_amount FROM CustomerTransactions;

In [ ]:
%%sql
SELECT MIN(amount) AS minimum_amount FROM CustomerTransactions;

In [ ]:
%%sql
SELECT MAX(amount) AS maximum_amount FROM CustomerTransactions;

In [ ]:
%%sql
SELECT AVG(amount) AS average_amount FROM CustomerTransactions;

## GROUP BY and HAVING

In [ ]:
%%sql
SELECT login_device, SUM(amount) AS total_spent
FROM CustomerTransactions
GROUP BY login_device;

In [ ]:
%%sql
SELECT login_device, SUM(amount) AS total_spent
FROM CustomerTransactions
GROUP BY login_device
HAVING SUM(amount) > 70000;

## Logical Operators (AND, OR, XOR, NOT, IN, NOT IN)

In [ ]:
%%sql
SELECT COUNT(*) FROM CustomerTransactions WHERE transaction_status = 'Pending' AND product = 'Laptop';

In [ ]:
%%sql
SELECT COUNT(*) FROM CustomerTransactions WHERE transaction_status = 'Pending' OR transaction_status = 'Failed';

In [ ]:
%%sql
SELECT * FROM CustomerTransactions WHERE is_placed = 1 XOR is_viewed = 1;

In [ ]:
%%sql
SELECT * FROM CustomerTransactions WHERE NOT transaction_status = 'Completed';

In [ ]:
%%sql
SELECT COUNT(*) FROM CustomerTransactions WHERE product IN ('Laptop', 'Smartphone', 'Tablet');

In [ ]:
%%sql
SELECT * FROM CustomerTransactions WHERE product NOT IN ('Laptop', 'Smartphone', 'Tablet');

## CASE WHEN (Conditional Logic)

In [ ]:
%%sql
SELECT customer_name, amount, CASE WHEN amount > 20000 THEN 'High' WHEN amount BETWEEN 10000 AND 20000 THEN 'Medium' ELSE 'Low' END AS amount_category FROM CustomerTransactions;

## NULL Handling and COALESCE

In [ ]:
%%sql
CREATE TABLE CustomerData (Sn_no INT, Customer_name VARCHAR(30), Email VARCHAR(50), Phone_number VARCHAR(10), address VARCHAR(50), amount DECIMAL(10,2));

In [ ]:
%%sql
INSERT INTO CustomerData VALUES (1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', 5000.00), (2, 'Priya', NULL, '9876', 'Bangalore', NULL), (3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00), (4, 'Meena', NULL, NULL, 'Mumbai', 2500.00), (5, 'Karthik', 'karthik@example.com', '9876', NULL, 3000.00);

In [ ]:
%%sql
SELECT * FROM CustomerData;

In [ ]:
%%sql
SELECT * FROM CustomerData WHERE email IS NULL AND Phone_number IS NULL OR address IS NULL;

In [ ]:
%%sql
SELECT Sn_no, Customer_name, COALESCE(Email, 'No Email') AS Email, COALESCE(Phone_number, 'No Phone') AS Phone_number, COALESCE(address, 'No Address') AS address, COALESCE(amount, 0) AS amount FROM CustomerData;

In [ ]:
%%sql
SELECT Sn_no, Customer_name, COALESCE(amount, (SELECT AVG(amount) FROM CustomerData)) AS amount_with_avg FROM CustomerData;